// Напишите программу, которая принимает на вход целое число и выдает его квадрат
Console.WriteLine("Введите число: ... ");
int namberA = Convert.ToInt32(Console.ReadLine());
Console.WriteLine(namberA*namberA);
